; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-3-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p0-5 - location
	p2-4 - location
	p3-0 - location
	p3-4 - location
	p4-0 - location
	p4-1 - location
	p5-3 - location
	p5-4 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s1)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at package1 s0)
	(at package2 s2)
	(at package3 s2)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(link s0 s2)
	(link s2 s0)
	(link s0 s5)
	(link s5 s0)
	(link s1 s3)
	(link s3 s1)
	(link s1 s5)
	(link s5 s1)
	(link s3 s0)
	(link s0 s3)
	(link s3 s4)
	(link s4 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s1)
	(link s1 s4)
	(link s4 s5)
	(link s5 s4)
	(link s5 s2)
	(link s2 s5)
	(link s5 s3)
	(link s3 s5)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s3)
	(at driver3 s3)
	(at truck1 s5)
	(at truck3 s3)
	(at package1 s5)
	(at package2 s1)
	(at package3 s3)
	))


)

; plan
1. (walk driver3 s1 p4-1)
   deleted: (at driver3 s1)
   added: (at driver3 p4-1)
   goals met: 0 of 8
2. (walk driver3 p4-1 s4)
   deleted: (at driver3 p4-1)
   added: (at driver3 s4)
   goals met: 0 of 8
3. (walk driver3 s4 p2-4)
   deleted: (at driver3 s4)
   added: (at driver3 p2-4)
   goals met: 0 of 8
4. (walk driver3 p2-4 s2)
   deleted: (at driver3 p2-4)
   added: (at driver3 s2)
   goals met: 0 of 8
5. (walk driver1 s0 p3-0)
   deleted: (at driver1 s0)
   added: (at driver1 p3-0)
   goals met: 0 of 8
6. (walk driver1 p3-0 s3)
   deleted: (at driver1 p3-0)
   added: (at driver1 s3)
   goals met: 1 of 8
7. (load-truck package3 truck3 s2)
   deleted: (at package3 s2)
   added: (in package3 truck3)
   goals met: 1 of 8
8. (load-truck package2 truck3 s2)
   deleted: (at package2 s2)
   added: (in package2 truck3)
   goals met: 1 of 8
9. (board-truck driver3 truck3 s2)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 1 of 8
10. (drive-truck truck3 s2 s0 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 1 of 8
11. (load-truck package1 truck3 s0)
   deleted: (at package1 s0)
   added: (in package1 truck3)
   goals met: 1 of 8
12. (drive-truck truck3 s0 s5 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s5)
   goals met: 1 of 8
13. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 8
14. (drive-truck truck1 s1 s5 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 2 of 8
15. (disembark-truck driver2 truck1 s5)
   deleted: (driving driver2 truck1)
   added: (at driver2 s5) (empty truck1)
   goals met: 2 of 8
16. (unload-truck package1 truck3 s5)
   deleted: (in package1 truck3)
   added: (at package1 s5)
   goals met: 3 of 8
17. (drive-truck truck3 s5 s1 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   goals met: 3 of 8
18. (unload-truck package2 truck3 s1)
   deleted: (in package2 truck3)
   added: (at package2 s1)
   goals met: 4 of 8
19. (drive-truck truck3 s1 s3 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   goals met: 5 of 8
20. (disembark-truck driver3 truck3 s3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s3) (empty truck3)
   goals met: 6 of 8
21. (unload-truck package3 truck3 s3)
   deleted: (in package3 truck3)
   added: (at package3 s3)
   goals met: 7 of 8
22. (walk driver2 s5 p5-3)
   deleted: (at driver2 s5)
   added: (at driver2 p5-3)
   goals met: 7 of 8
23. (walk driver2 p5-3 s3)
   deleted: (at driver2 p5-3)
   added: (at driver2 s3)
   goals met: 8 of 8
